
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |   🔴 Destroy |
|----------:|---------:|----------:|-------------:|
|        ✅ |       12 |         0 |           10 |
## Affected resources by action

|  Action  | Resources                                                                                |
|:--------:|:-----------------------------------------------------------------------------------------|
|    🟢    | `module.service-network-tester.aws_iam_policy.pytest-permissions`                        |
|    🟢    | `module.service-network-tester.aws_iam_policy.role-permissions`                          |
|    🟢    | `module.service-network-tester.aws_iam_role.role-tester`                                 |
|    🟢    | `module.service-network-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢    | `module.service-network-tester.aws_iam_role_policy_attachment.role-permissions`          |
|    🟢    | `module.service-network-tester.aws_iam_role_policy_attachment.role-pytest-permissions`   |
|    🔴    | `aws_iam_policy.service-network-tester-permissions`                                      |
|    🔴    | `aws_iam_role.service-network-tester`                                                    |
|    🔴    | `aws_iam_role_policy_attachment.service-network-tester`                                  |
|    🔴    | `aws_iam_role_policy_attachment.service-network-tester-pytest-permissions`               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.service-network-tester-permissions will be destroyed
  # (because aws_iam_policy.service-network-tester-permissions is not in configuration)
  - resource "aws_iam_policy" "service-network-tester-permissions" {
      - arn              = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> null
      - attachment_count = 7 -> null
      - id               = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> null
      - name             = "service-network-tester-permissions" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sts:GetCallerIdentity",
                          - "sts:AssumeRole",
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:ReleaseAddress",
                          - "ec2:ModifySubnetAttribute",
                          - "ec2:DisassociateRouteTable",
                          - "ec2:DisassociateAddress",
                          - "ec2:DetachInternetGateway",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeVpcClassicLinkDnsSupport",
                          - "ec2:DescribeVpcClassicLink",
                          - "ec2:DescribeVpcAttribute",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeSecurityGroupRules",
                          - "ec2:DescribeRouteTables",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeNetworkAcls",
                          - "ec2:DescribeNatGateways",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeAddresses",
                          - "ec2:DeleteVpc",
                          - "ec2:DeleteSubnet",
                          - "ec2:DeleteRouteTable",
                          - "ec2:DeleteRoute",
                          - "ec2:DeleteNatGateway",
                          - "ec2:DeleteInternetGateway",
                          - "ec2:CreateVpc",
                          - "ec2:CreateTags",
                          - "ec2:CreateSubnet",
                          - "ec2:CreateRouteTable",
                          - "ec2:CreateRoute",
                          - "ec2:CreateNatGateway",
                          - "ec2:CreateInternetGateway",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                          - "ec2:AttachInternetGateway",
                          - "ec2:AssociateRouteTable",
                          - "ec2:AllocateAddress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUNKAUEN33MCJJM32U" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.service-network-tester will be destroyed
  # (because aws_iam_role.service-network-tester is not in configuration)
  - resource "aws_iam_role" "service-network-tester" {
      - arn                   = "arn:aws:iam::303467602807:role/service-network-tester" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::990466748045:user/aleks",
                              - "arn:aws:iam::303467602807:role/service-network-tester",
                            ]
                        }
                      - Sid       = "000"
                    },
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-service-network:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = "010"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-07-03T19:21:33Z" -> null
      - description           = "Role to test module terraform-aws-service-network" -> null
      - force_detach_policies = false -> null
      - id                    = "service-network-tester" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001",
          - "arn:aws:iam::303467602807:policy/service-network-tester-permissions",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "service-network-tester" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
      - unique_id             = "AROAUNKAUEN3XWQAJJN36" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.bookstack-tester-service-network-permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "bookstack-tester-service-network-permissions" {
      ~ id         = "bookstack-tester-20240519152050161300000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.ecs-tester-service-network-permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs-tester-service-network-permissions" {
      ~ id         = "ecs-tester-20231123162056216700000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.elasticsearch-tester-service-network-permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "elasticsearch-tester-service-network-permissions" {
      ~ id         = "elasticsearch-tester-20240205185311908700000003" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.jumphost-tester-admin-permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "jumphost-tester-admin-permissions" {
      ~ id         = "jumphost-tester-20231230033000404900000004" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.service-network-tester will be destroyed
  # (because aws_iam_role_policy_attachment.service-network-tester is not in configuration)
  - resource "aws_iam_role_policy_attachment" "service-network-tester" {
      - id         = "service-network-tester-20230703194225287600000001" -> null
      - policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> null
      - role       = "service-network-tester" -> null
    }

  # aws_iam_role_policy_attachment.service-network-tester-pytest-permissions will be destroyed
  # (because aws_iam_role_policy_attachment.service-network-tester-pytest-permissions is not in configuration)
  - resource "aws_iam_role_policy_attachment" "service-network-tester-pytest-permissions" {
      - id         = "service-network-tester-20231009203124842800000002" -> null
      - policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001" -> null
      - role       = "service-network-tester" -> null
    }

  # aws_iam_role_policy_attachment.terraformer-tester-service-network-permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "terraformer-tester-service-network-permissions" {
      ~ id         = "terraformer-tester-20240319165550891700000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions must be replaced
-/+ resource "aws_iam_role_policy_attachment" "website-pod-tester-sernive-network-permissions" {
      ~ id         = "website-pod-tester-20231123173533923800000003" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.service-network-tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "pytest-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.service-network-tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "service-network-tester-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.service-network-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:role/service-network-tester"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-service-network:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-service-network"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "service-network-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.service-network-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "service-network-tester"
    }

  # module.service-network-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "service-network-tester"
    }

  # module.service-network-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "service-network-tester"
    }

Plan: 12 to add, 0 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEyLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAxMH19
```
</details>